{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ba\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 64, 200, 3], "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "linear", "init": "he_normal", "nb_row": 5, "name": "convolution2d_1", "bias": true, "nb_filter": 24, "b_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "linear", "init": "he_normal", "nb_row": 5, "name": "convolution2d_2", "bias": true, "nb_filter": 36, "b_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "linear", "init": "he_normal", "nb_row": 5, "name": "convolution2d_3", "bias": true, "nb_filter": 48, "b_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "linear", "init": "he_normal", "nb_row": 3, "name": "convolution2d_4", "bias": true, "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "linear", "init": "he_normal", "nb_row": 3, "name": "convolution2d_5", "bias": true, "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "init": "he_normal", "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 1152, "output_dim": 100, "activity_regularizer": null, "trainable": true, "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "init": "he_normal", "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 100, "output_dim": 50, "activity_regularizer": null, "trainable": true, "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "init": "he_normal", "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 50, "output_dim": 10, "activity_regularizer": null, "trainable": true, "W_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "init": "he_normal", "name": "dense_4", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 10, "output_dim": 1, "activity_regularizer": null, "trainable": true, "W_constraint": null}}], "class_name": "Sequential"}